# TrussClosedReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TrussClosedReference Property
BuiltInFailures..::..SketchFailures Class See Also
---
Truss references (chains of one or more reference lines) should not form closed loops."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussClosedReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussClosedReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussClosedReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace